tour206_api/app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows"
---
  def index
    @shows = Show.all