app/controllers/shows_controller.rb

SELECT "shows".* FROM "shows"
---
  def index
    @shows = Show.all

INSERT INTO "shows" ("name", "start", "description", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    puts "LSDKFJLDKFJLSDKFJLSDKF"
    puts params
    @show = Show.new(show_params)

    if @show.save

UPDATE "shows" SET "description" = $1, "updated_at" = $2 WHERE "shows"."id" = $3  [["description", "testing"], ["updated_at", "2017-09-11 22:54:00.687368"], ["id", 19]]
---
  def update
    if @show.update(show_params)

DELETE FROM "shows" WHERE "shows"."id" = $1  [["id", 8]]
---
  def destroy
    @show.destroy

SELECT  "shows".* FROM "shows" WHERE "shows"."id" = $1 LIMIT $2  [["id", 19], ["LIMIT", 1]]
---
    def set_show
      @show = Show.find(params[:id])